#Варіант 11

import random


print ('Биберіть варіант дій де: 1 - ввести данні самому , 2 - випадковий вибір')
a = int(input(''))

if a == 1:
    day = int(input('Введіть день тижня від 1 до 7 :'))
    weeks = {
        1: 'Понеділок... Гарфілд також не любив понеділок (Робочій день)',
        2: 'Вівторок (Робочій день)',
        3: 'Середа (Робочій день)',
        4: 'Четверг (Робочій день)',
        5: 'Пятниця (Робочій день)',
        6: 'Субота (Виходний , але не завжди :) )',
        7: 'Неділя (Виходний)',
    }
    print(weeks[day])
elif a == 2:
    day = random.randint(1, 7)
    weeks = {
        1: 'Понеділок... Гарфілд також не любив понеділок (Робочій день)',
        2: 'Вівторок (Робочій день)',
        3: 'Середа (Робочій день)',
        4: 'Четверг (Робочій день)',
        5: 'Пятниця (Робочій день)',
        6: 'Субота (Виходний , але не завжди :) )',
        7: 'Неділя (Виходний)',
    }
    print(weeks[day])
else:
    print('Введений не правильний варіант')
        
    
